public_html/linux/my_i3wm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-11 一 11:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>我的i3wm</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="renshuo" />
<link rel="stylesheet" type="text/css" href="/blog/public_html/theme/css/worg.css"/>
                       <link rel="stylesheet" type="text/css" href="/gitPage/public_html/theme/css/worg.css"/>
                       <link rel="stylesheet" type="text/css" href="theme/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">我的i3wm</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b965ea">从 kde 切换到 i3 的动机</a></li>
<li><a href="#orgc9b6eb5">我的工具集：</a></li>
<li><a href="#org3bb7872">思考：</a>
<ul>
<li><a href="#org33c6657">我在向 kde 靠拢？</a></li>
<li><a href="#orge0f07eb">还有哪里不一样了呢？</a></li>
<li><a href="#org4d66011">结论：</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org4b965ea" class="outline-2">
<h2 id="org4b965ea">从 kde 切换到 i3 的动机</h2>
<div class="outline-text-2" id="text-org4b965ea">
<p>
我一直使用 kde，从 kde3 到现在的 plasma，期间也尝试过别的 wm，但是都只是简单安装和试用，没有深入体会过不同类型 wm 的特点。直到最近看到一片文章 <a href="https://sspai.com/post/52548">跨平台生产力指南&#x2013;2018年我对于数字生产力的思考</a> , 这篇文章分别从道，术，器三个层次讲述了工具对生产力的影响。于是在文章的指引下，将我的桌面切换到了 i3wm。
</p>
</div>
</div>

<div id="outline-container-orgc9b6eb5" class="outline-2">
<h2 id="orgc9b6eb5">我的工具集：</h2>
<div class="outline-text-2" id="text-orgc9b6eb5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">i3wm</td>
<td class="org-left">平铺类窗口管理</td>
</tr>

<tr>
<td class="org-left">polybar</td>
<td class="org-left">系统工具/状态栏</td>
</tr>

<tr>
<td class="org-left">jgmenu</td>
<td class="org-left">系统 app 菜单</td>
</tr>

<tr>
<td class="org-left">rofi</td>
<td class="org-left">快速启动</td>
</tr>

<tr>
<td class="org-left">tdop</td>
<td class="org-left">快速访问工具</td>
</tr>

<tr>
<td class="org-left">tmux</td>
<td class="org-left">终端管理</td>
</tr>

<tr>
<td class="org-left">emacs</td>
<td class="org-left">文本编辑</td>
</tr>

<tr>
<td class="org-left">krusader</td>
<td class="org-left">文件浏览</td>
</tr>

<tr>
<td class="org-left">konsole</td>
<td class="org-left">终端</td>
</tr>

<tr>
<td class="org-left">dunst</td>
<td class="org-left">通知管理</td>
</tr>

<tr>
<td class="org-left">feh</td>
<td class="org-left">壁纸</td>
</tr>

<tr>
<td class="org-left">nmcli</td>
<td class="org-left">网络配置</td>
</tr>

<tr>
<td class="org-left">pulsemixer</td>
<td class="org-left">音量控制</td>
</tr>

<tr>
<td class="org-left">xrandr,arandr</td>
<td class="org-left">屏幕控制</td>
</tr>

<tr>
<td class="org-left">dde-calendar</td>
<td class="org-left">日历</td>
</tr>
</tbody>
</table>

<p>
具体配置参考：<a href="https://github.com/renshuo/shellScript.git">https://github.com/renshuo/shellScript.git</a> 的 config/i3
</p>

<p>
通过以上工具，我打造了我的新工作环境。
</p>
</div>
</div>

<div id="outline-container-org3bb7872" class="outline-2">
<h2 id="org3bb7872">思考：</h2>
<div class="outline-text-2" id="text-org3bb7872">
</div>
<div id="outline-container-org33c6657" class="outline-3">
<h3 id="org33c6657">我在向 kde 靠拢？</h3>
<div class="outline-text-3" id="text-org33c6657">
<p>
我发现我配置完的 i3wm，和我的 kde 很相似：屏幕最右下方是系统信息（日期，电量，网络，音量等），左下方是工作区列表，窗口名，以及一个开始菜单。我的 kde 界面也是这样的。（ps，这个界面和 windows 一致）。为什么会这样？我本想通过新的工具，提升工作效率，但是为什么会回到原来的状态？也就是说，原本的 kde 就是我最大工作效率的状态？
</p>

<p>
回到《跨平台生产力指南&#x2013;2018 年我对于数字生产力的思考》文章的道的部分，作者提出了 3 个工具要解决的问题： 1.禅模式，2.快速访问 3.通用工具。
</p>

<p>
在 kde 中如何解决这 3 个问题呢？
</p>
<ol class="org-ol">
<li>禅模式：其实就是将工作区最大化，这个工作区可能是一个 consle，或者 emacs，也可能是 tmux，emacs，或者 firefox+chrome+emacs, 或者是一个 IDEA 等等，只要最大化你当前需要的工具集就行。kde 也可支持平铺模式（<a href="https://github.com/kwin-scripts/kwin-tiling.git">kwin-tiling</a>）。另外，如果你的常用工具本身支持平铺，比如 emacs，tmux，firefox（插件支持），或者工具不需要多窗口，那即使 wm 不支持平铺也没问题。</li>
<li>快速访问：快速访问的意思就是说， 可以在系统顶层直接访问各种资源，包括启动程序，打开文件，打开各种东西的地方。krunner 基本达到了像 rofi，dmenu 这类快速访问工具的一流水准。另外，kde 的开始菜单，是用来打开你不记得名字的工具的，是快速访问功能的一个重要补充。其实，像 krusader，dolphin 等文件浏览工具，也是作为快速访问工具的补充的，核心思想就是，当你不记得名字的时候，可以通过选择的方式，找到你要的资源。</li>
<li>通用工具：在我看来，所谓通用工具包括 2 个问题，1,在不同工具（需要做不同的事情）中共享信息，比如共用终端，共用 emacs，全局剪贴板。 2,用一个工具做不同的事情，比如用 tmux 在一个终端大界面中启动多个命令行工具，在一个 emacs 中编辑多个文件，在 IDEA 中打开多个模块（同一个项目）。好在这些工具在所有环境下都基本可用，都是通用的。 在 kde 下可以用 yakuake，也可以配置 tdop 支持。</li>
</ol>
</div>
</div>


<div id="outline-container-orge0f07eb" class="outline-3">
<h3 id="orge0f07eb">还有哪里不一样了呢？</h3>
<div class="outline-text-3" id="text-orge0f07eb">
<p>
还有哪里不一样了呢？不一样的地方有 2 个，一是 i3wm 的窗口平铺特性，二是大量的快捷键。这 2 个问题，在以往的 kde 中并不完整或者我自己没有意识到。
</p>

<p>
如何解决：
</p>

<p>
窗口平铺特性：虽然 kde 有 kwin-tiling 支持平铺，但是毕竟不是 kde 原生的，还不完善，比如，和 tdrop 配合不好。解决方法：使用本身支持类平铺功能的软件，比如 tmux，emacs；kde 有 “拼接” 功能，类似 windows 中的拖动窗口到屏幕边缘时，自动将窗口大小改为 1/4 或者 1/2 并放在对应位置。
</p>

<p>
快捷键：kde 支持自定义快捷键，但是只是简单模式，不支持类似 vi 的模式，也不支持类似 emacs 的键序列。但是，是否真的需要模式或者键序列？在 wm 下绑定快捷键的目的有这些：1. 快速启动程序，2. 操作 wm（切换工作区，移动/缩小/最大化/关闭 某窗口）, 3. 访问通用工具，tdrop，截图，切换输入法，切换大小写等。这些项目并不算多，完全可以依靠一层快捷键搞定。所要做的就是精心定制快捷键。
</p>
</div>
</div>

<div id="outline-container-org4d66011" class="outline-3">
<h3 id="org4d66011">结论：</h3>
<div class="outline-text-3" id="text-org4d66011">
<p>
回到 kde
</p>

<p>
需要完成以下事项：
</p>
<ol class="org-ol">
<li>使用 tdrop 快速访问终端，emacs 和 krusade。</li>
<li>使用 krunner</li>
<li>使用 tmux 管理终端，或者仍旧使用 yakuake，但是要合理配置快捷键。</li>
<li>重新定制快捷键</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: renshuo</p>
<p class="date">Created: 2020-05-11 一 11:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
